&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.Свойство("РазрешилиБезТехкарты") Тогда
		Возврат;
	КонецЕсли;
	
	Результат = НоменклатураСобытия.ПроверитьВозможностьАвтосоздания(Объект.ВидНоменклатуры);
	
	Если НЕ Результат.ВсёОк Тогда
		Отказ = Истина;
		ТекстВопроса = Результат.ТекстОшибки + " Продолжить создание без техкарты?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОЗаписи", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОЗаписи(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ПараметрыДляЗаписи = Новый Структура("РазрешилиБезТехкарты", Истина);
		ЭтотОбъект.Записать(ПараметрыДляЗаписи);
		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.Свойство("РазрешилиБезТехкарты") Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("РазрешилиБезТехкарты", Истина);
	КонецЕсли;
КонецПроцедуры


	