

&НаКлиенте
Процедура ТестИнтеграции(Команда)
	ЮклайнсAPI.ЗагрузитьОплатыИзYClients();
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеУслуг(Команда)
	ЮклайнсAPI.ВыгрузитьСписокУслугИзYClients();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОчереди(Команда)
	ЮклайнсОбработкаОчереди.ОбработатьОчередьИнтеграции();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЗаписи(Команда)
	ЮклайнсAPI.ВыгрузитьЗаписиИзYClients();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьМастеров(Команда)
	ЮклайнсAPI.ВыгрузитьСотрудниковИзYClients();
КонецПроцедуры
#Область Константы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Настройки = ЮклайнсAPI.Настройки();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Настройки);
	ЮклайнсAPI.ПроверитьТекущиеНастройки();
КонецПроцедуры
&НаСервере
Процедура ОбработкаИзмененияРеквизитаКонстанты(Элемент, ИмяРеквизита)
	Настройки = ЮклайнсAPI.Настройки();
	Настройки.Вставить(ИмяРеквизита, ЭтотОбъект[ИмяРеквизита]);
	Константы.Юклайнс_Настройки.Установить(Новый ХранилищеЗначения(Настройки));
КонецПроцедуры
&НаКлиенте
Процедура ДатаКонцаЗаписейПриИзменении(Элемент)
	ОбработкаИзмененияРеквизитаКонстанты(ЭтотОбъект.ДатаКонцаЗаписей, "ДатаКонцаЗаписей");
КонецПроцедуры
&НаКлиенте
Процедура ДатаКонцаТранзакцийПриИзменении(Элемент)
	ОбработкаИзмененияРеквизитаКонстанты(ЭтотОбъект.ДатаКонцаТранзакций, "ДатаКонцаТранзакций");
КонецПроцедуры
&НаКлиенте
Процедура ДатаНачалаЗаписейПриИзменении(Элемент)
	ОбработкаИзмененияРеквизитаКонстанты(ЭтотОбъект.ДатаНачалаЗаписей, "ДатаНачалаЗаписей");
КонецПроцедуры
&НаКлиенте
Процедура ДатаНачалаТранзакцийПриИзменении(Элемент)
	ОбработкаИзмененияРеквизитаКонстанты(ЭтотОбъект.ДатаНачалаТранзакций, "ДатаНачалаТранзакций");
КонецПроцедуры
&НаКлиенте
Процедура ЮклайнсURLПутьПриИзменении(Элемент)
	ОбработкаИзмененияРеквизитаКонстанты(ЭтотОбъект.ЮклайнсURLПуть, "ЮклайнсURLПуть");
КонецПроцедуры
&НаКлиенте
Процедура ЮклайнсЗадержкаПовтораПриИзменении(Элемент)
	ОбработкаИзмененияРеквизитаКонстанты(ЭтотОбъект.ЮклайнсЗадержкаПовтора, "ЮклайнсЗадержкаПовтора");
КонецПроцедуры
&НаКлиенте
Процедура ЮклайнсМаксПовторовПриИзменении(Элемент)
	ОбработкаИзмененияРеквизитаКонстанты(ЭтотОбъект.ЮклайнсМаксПовторов, "ЮклайнсМаксПовторов");
КонецПроцедуры
&НаКлиенте
Процедура ЮклайнсРазмерПачкиПриИзменении(Элемент)
	ОбработкаИзмененияРеквизитаКонстанты(ЭтотОбъект.ЮклайнсРазмерПачки, "ЮклайнсРазмерПачки");
КонецПроцедуры

&НаКлиенте
Процедура ЮклайнсURLБазовыйПриИзменении(Элемент)
	ОбработкаИзмененияРеквизитаКонстанты(ЭтотОбъект.ЮклайнсURLБазовый, "ЮклайнсURLБазовый");
КонецПроцедуры

&НаКлиенте
Процедура ID_КомпанииПриИзменении(Элемент)
	ОбработкаИзмененияРеквизитаКонстанты(ЭтотОбъект.ID_Компании, "ID_Компании");
КонецПроцедуры

&НаКлиенте
Процедура ID_ПартнераПриИзменении(Элемент)
	ОбработкаИзмененияРеквизитаКонстанты(ЭтотОбъект.ID_Партнера, "ID_Партнера");
КонецПроцедуры

&НаКлиенте
Процедура ТокенПользователяПриИзменении(Элемент)
	ОбработкаИзмененияРеквизитаКонстанты(ЭтотОбъект.ТокенПользователя, "ТокенПользователя");
КонецПроцедуры

&НаКлиенте
Процедура ТокенПартнераПриИзменении(Элемент)
	ОбработкаИзмененияРеквизитаКонстанты(ЭтотОбъект.ТокенПартнера, "ТокенПартнера");
КонецПроцедуры

&НаКлиенте
Процедура ЮклайнсБлокировкаВремяПриИзменении(Элемент)
	ОбработкаИзмененияРеквизитаКонстанты(ЭтотОбъект.ЮклайнсБлокировкаВремя, "ЮклайнсБлокировкаВремя");
КонецПроцедуры

#КонецОбласти