// Записывает данные в регистр сведений ЖурналЛогирования.
//
// Параметры:
//   Параметры - Структура - значения для заполнения реквизитов записи регистра
Процедура ЗаписатьВРегистрЛогированияФон(Параметры) Экспорт
	МенеджерЗаписи = РегистрыСведений.ЖурналЛогирования.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Параметры);
	Попытка
		МенеджерЗаписи.Записать(Истина);
	Исключение
		ЗаписьЖурналаРегистрации("Логирование.ЗаписьФон",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

// Записывает метрику в регистр сведений для логирования операций.
//
// Параметры:
//   ТипМетрики - Строка - тип метрики
//   Операция - Строка - выполняемая операция
//   СтруктураДанных - Структура - значения для заполнения дополнительных полей записи
Процедура ЗаписатьМетрику(ТипМетрики, Операция, СтруктураДанных) Экспорт
	
	Менеджер = РегистрыСведений.ЮклайнсМетрики.СоздатьМенеджерЗаписи();
	Менеджер.ПериодМс = ТекущаяДатаСеанса();
	Менеджер.ТипМетрики = ТипМетрики; 
	Менеджер.ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор());
	Менеджер.Операция = Операция;

	ЗаполнитьЗначенияСвойств(Менеджер, СтруктураДанных);
	
	Попытка
		Менеджер.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Логирование.ЗаписатьМетрику",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры