&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьНазваниеБлюда();
КонецПроцедуры
&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	ЗаполнитьНазваниеБлюда();
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьНазваниеБлюда()
	Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда
		НазваниеБлюда = Неопределено;
	Иначе
		НазваниеБлюда = Объект.Владелец;
	КонецЕсли;
	УстановитьОтборСписка();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСписка()
	СписокКБЖУ.Отбор.Элементы.Очистить();
	Если ЗначениеЗаполнено(ЭтотОбъект.НазваниеБлюда) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокКБЖУ.Отбор, "Номенклатура", ЭтотОбъект.НазваниеБлюда);
	КонецЕсли;
КонецПроцедуры