Функция ТаблицаДляПроведения(Ссылка, Период, Отказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Услуги.Номенклатура КАК Номенклатура,
	|	Услуги.Количество КАК Количество,
	|	Услуги.Сумма КАК Сумма,
	|	&Ссылка КАК Ссылка,
	|	&Период КАК Период,
	|	&Мастер КАК Мастер,
	|	Услуги.Ссылка.СуммаНачисления КАК Бонусы,
	|	&Клиент КАК Клиент,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	|	ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	Документ.ОказаниеУслуг.Услуги КАК Услуги
	|ГДЕ
	| Услуги.Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ	Клиент, Бонусы КАК Количество, ВидДвижения, Период ИЗ ВТ_Данные
	|;
	|ВЫБРАТЬ	Клиент, Номенклатура, Мастер, Количество, Сумма, Период ИЗ ВТ_Данные
	| УПОРЯДОЧИТЬ ПО Номенклатура";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Мастер", Ссылка.Мастер);
	Запрос.УстановитьПараметр("Клиент", Ссылка.Клиент);
	Запрос.УстановитьПараметр("Период", Период);
	Пакет = Запрос.ВыполнитьПакет();
	РезультатСтруктура = Новый Структура;
	РезультатСтруктура.Вставить("Бонусы", Пакет[1].Выгрузить());
	РезультатСтруктура.Вставить("ПродажаУслуг", Пакет[2].Выгрузить());
	Возврат РезультатСтруктура;
КонецФункции