// Устанавливает признак нового объекта в дополнительных свойствах для номенклатуры.
//
// Параметры:
//   Источник - СправочникОбъект.Номенклатура - записываемый объект
//   Отказ - Булево - признак отмены записи
Процедура НоменклатураПередЗаписью(Источник, Отказ) Экспорт
	Если Источник.ЭтоНовый() Тогда
		Источник.ДополнительныеСвойства.Вставить("ЭтоНовыйОбъект", Истина);
	КонецЕсли;
КонецПроцедуры

// Проверяет возможность автоматического создания элементов номенклатуры на основе вида номенклатуры.
//
// Параметры:
//   ВидНоменклатуры - см. Перечисление.ВидыНоменклатуры - вид номенклатуры, для которого проверяется возможность автосоздания
//
// Возвращаемое значение:
//   Структура:
//     * ВсёОк - Булево - Истина, если автоматическое создание возможно, иначе Ложь
//     * ТекстОшибки - Строка - описание причины невозможности автоматического создания
Функция ПроверитьВозможностьАвтосоздания(ВидНоменклатуры) Экспорт
	Результат = Новый Структура("ВсёОк, ТекстОшибки", Истина, "");
	ИмяСправочника = ВидНоменклатуры.ИмяПодчиненногоСправочника;
	Если НЕ ЗначениеЗаполнено(ИмяСправочника) Тогда
		Результат.ВсёОк = Ложь;
		Результат.ТекстОшибки = "Не указан подчиненный справочник в виде номенклатуры.";
	ИначеЕсли Метаданные.Справочники.Найти(ИмяСправочника) = Неопределено Тогда
		Результат.ВсёОк = Ложь;
		Результат.ТекстОшибки = "Справочник '" + ИмяСправочника + "' не найден в системе.";
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Создает подчиненный элемент справочника для вновь создаваемой номенклатуры
//
// Параметры:
//   Источник - СправочникОбъект.Номенклатура - записываемый элемент справочника
//   Отказ - Булево
Процедура НоменклатураПриЗаписи(Источник, Отказ) Экспорт
	Если Источник.ДополнительныеСвойства.Свойство("РазрешилиБезТехкарты") Тогда
        Возврат; 
    КонецЕсли;
	Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовыйОбъект") Тогда
		ИмяСправочника = Источник.ВидНоменклатуры.ИмяПодчиненногоСправочника;
		Если ЗначениеЗаполнено(ИмяСправочника) Тогда
			Попытка
				НовыйОбъект = Справочники[ИмяСправочника].СоздатьЭлемент();
				НовыйОбъект.Владелец = Источник.Ссылка;
				НовыйОбъект.Наименование = "Основная запись для " + Источник.Наименование;
				НовыйОбъект.Записать();
			Исключение
				ДанныеЛога = Новый Структура("Объект, Сообщение, ДопДанные", Источник.Метаданные().Имя, "Ошибка при автосоздании Номенклатуры", ОписаниеОшибки());
				ЛогированиеПриложений.Ошибка("НоменклатураПриЗаписи.Ошибка", ДанныеЛога);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

