// Возвращает список обязательных реквизитов
Функция ОбязательныеРеквизиты() Экспорт
	Массив = Новый Массив;
	Массив.Добавить("Поставщик");
	Возврат Массив;
КонецФункции
// Возвращает обязательные реквизиты табличных частей
Функция ОбязательныеРеквизитыТЧ() Экспорт
	Структура = Новый Структура;
	Структура.Вставить("Товары", СтрРазделить("Номенклатура,Количество,Цена", ","));
	Возврат Структура;
КонецФункции

Функция ТаблицаДляПроведения(Ссылка,Период, Отказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.Сумма КАК Сумма,
	|	&Ссылка КАК Партия,
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	|	ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	Документ.ПриходнаяНакладная.Товары КАК ТЧ
	| ГДЕ
	| ТЧ.Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ Номенклатура, Количество, Сумма, ВидДвижения, Период ИЗ ВТ_Данные
	|УПОРЯДОЧИТЬ ПО Номенклатура
	|;
	|ВЫБРАТЬ * ИЗ ВТ_Данные
	|УПОРЯДОЧИТЬ ПО Номенклатура";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Период);
	Пакет = Запрос.ВыполнитьПакет();
	Результат = Новый Структура;
	Результат.Вставить("ТоварыНаСкладах", Пакет[1].Выгрузить());
	Результат.Вставить("ТоварыНаСкладахПартии", Пакет[2].Выгрузить());
	Возврат Результат;
КонецФункции


